app/views/coupons/_coupons.html.erb

  <td><%=coupons.description%></td>
  <td><%= coupons.coupon_dates.map(&:send_date).join(", ") %></td>
---
SELECT "coupon_dates".* FROM "coupon_dates" WHERE "coupon_dates"."coupon_id" = ?  [["coupon_id", 1]]
SELECT "coupons".* FROM "coupons"