app/views/customers/_customer_detail.html.erb

  <td><%=customer_detail.last_visit_date%></td>
  <td><%=customer_detail.cars.count%></td>
---
SELECT COUNT(*) FROM "cars" WHERE "cars"."customer_id" = ?  [["customer_id", 11]]