app/controllers/coupons_controller.rb

SELECT "coupons".* FROM "coupons"
---
  def index
    @coupons = Coupon.all