app/controllers/customers_controller.rb

  def index
    @customer = Customer.all
---
SELECT "customers".* FROM "customers"

  def cars
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]